Revit 2015 API
AnalyticalModel.IsSurface Method
 Checks if the analytical model belongs to the surface object like floor, slab or wall.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015. To check if analytical model is surface type of element, try to downcast it to AnalyticalModelSurface.")]
public bool IsSurface()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015. To check if analytical model is surface type of element, try to downcast it to AnalyticalModelSurface.")> _
Public Function IsSurface As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015. To check if analytical model is surface type of element, try to downcast it to AnalyticalModelSurface.")]
public:
bool IsSurface()
Return Value
 True is returned when this object is AnalyticalModelSurface class, false otherwise.
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace